-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\mngari\OneDrive - Kemri Wellcome Trust\Statistical training\analysis0.log
  log type:  text
 opened on:  26 Mar 2021, 22:01:00

. 
. //Change my directory
. cd "C:\Users\mngari\OneDrive - Kemri Wellcome Trust\Statistical training"
C:\Users\mngari\OneDrive - Kemri Wellcome Trust\Statistical training

. dir
  <dir>   3/26/21 22:01  .                 
  <dir>   3/26/21 22:01  ..                
   0.0k   3/26/21 22:01  analysis0.log     
  22.3k   3/16/21 15:51  birth_weight.csv  
  <dir>   1/07/21 15:54  data              
  <dir>   1/07/21 15:54  EACCR             
   0.4k   3/26/21 21:59  Example1.do       
1529.6k   3/26/21 22:00  Introduction to stata.pptx
  <dir>   1/06/21 15:13  mon_frid_materials
  <dir>   3/04/21  8:46  New folder        
2993.5k   2/22/21 18:04  StataTutorial.pdf 
  50.2k  10/27/11 16:26  Statistics as a Career.pptx
 116.5k   7/12/11 15:17  Timetable09.doc   
 164.5k   7/20/11 12:15  Timetable2011.doc 
 651.4k   3/24/21 19:26  tutorial.pdf      

. 
. //Import data from .csv
. import delimited using birth_weight.csv,varnames(1) clear
(8 vars, 641 obs)

. 
. //describe the variables in the dataset
. des

Contains data
  obs:           641                          
 vars:             8                          
 size:        14,743                          
----------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------
id              int     %8.0g                 
matage          byte    %8.0g                 
ht              byte    %8.0g                 
gestwks         byte    %8.0g                 
sex             str6    %9s                   
bweight         int     %8.0g                 
ethnic          byte    %8.0g                 
agegrp          str9    %9s                   
----------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. 
. 
. 
. 
. 
. //close the log file
. log close
      name:  <unnamed>
       log:  C:\Users\mngari\OneDrive - Kemri Wellcome Trust\Statistical training\analysis0.log
  log type:  text
 closed on:  26 Mar 2021, 22:01:00
----------------------------------------------------------------------------------------------------------------
